{
  "email": [
    {
      "id": "rgyXtyBeC8V0uKvDV4zncpcFduo1",
      "posts": []
    },
    {
      "id": "C8APzHrPIjRjDnIvPwcKvrHYCkb2",
      "posts": [
        {
          "title": "COLLEGIANS GRAB 8 MEDALS, 3 GOLDS, IN SUPER CONFERENCE WEEKEND",
          "author": "Admin",
          "image": "https://www.islandsun.com/wp-content/uploads/2022/03/Gold_featured.png",
          "descr": "By Dean “The Sportsman” Greenaway Super Conference Weekend ended with BVI athletes winning 8 medals in 4 different Conferences, claiming 4 National Records, establishing 9 Personal Bests in 2 different sports, Swimming and Track and Field. On the home front, four athletes qualified for the World jr. Championships. Super Conference Gold: Super Conference Weekend began with swimmer Elinah Phillip of Florida International University, winning gold in the Conference USA, 50m Free, in a personal best and National Record time of 22.33 seconds, breaking her previous best of 22.41 at the Big Ten Championships swimming for Rutgers. She advanced to the final with the second best time of 22.64. On the track, Indiana’s Rikkoi Brathwaite, repeated as Big Ten Conference 60m champion, when he broke the tape in 6.57 seconds after advancing to the final with 6.67. He joined Minnesota’s Keita Cline, who won the 1994 and 1995 Triple Jump, as an indoor repeat champion. At the Southland Conference, Diamante Gumbs destroyed his 17.27m previous best, the Northwestern State University, school record of 18.71 and eclipsed Eldred Henry’s 19.56m National Record, to win the Southland Conference, 35 lbs Weight Throw, with a heave of 19.57m (64’2-1/2\"). Besides Henry, he joined Eric Matthias who previously held the National Record at 19.50m, as the third BVI athlete to throw 19.50m or better. Silver: After recording a 49.95 personal best in the prelims, Elinah Phillip picked up her second Conference USA individual medal to go with two relay golds, when she earned 100m Free silver, in a personal best of 49.87 secs. Central Florida’s Beyonce DeFreitas, also bagged silver, when she ran a personal best of 23.65 seconds for second in the American Athletics Conference, 200m. After leading qualifiers in the GLVC 60m, Zara Brown of Southwestern Baptist, was second in the 60m dash in 7.54 secs, after churning 7.47 in the prelims. With his twin brother, conference leader and school record holder Djimon fouling, Diamante Gumbs, stepped up to win the Shot Put crown, by shattering his 15.88m personal best, with a heave of 16.66m (54’8\"). Bronze Competing just 40m mins after the 60m, Brown grabbed 200m bronze in an indoor personal best of 24.90 secs. National Record Utah State’s Xiomara “Gia” Malone, became the BVI’s first athlete to penetrate the 1.70m High Jump barrier, when she tied for fourth in the Mountain West Conference, after scaling the bar at 1.72m (5’7-3/4). Malone who last month broke the 28 year old mark of 1.65m established in 1994 by Virgin Gorda’s Takola Creque, that was tied by Malone’s sister Chantel in 2008 and her former Timber Creek High School teammate Z’Niah “Z” Hutchinson in 2016, cleared 1.66, before her breakthrough jump. Personal Best Akira Phillip, a Javelin Throw specialist, the third BVI athlete at Northwestern State University, eclipsed the 12m barrier for the first time in the Shot Put, when she reached 12.01m (39’4¾”). Eastern New Mexico’s Arianna Hayde, was 5th in the Lone Star Conference Long Jump with a 5.49m (18’0”) effort and was 6th in the Triple Jump with 11.42m (37’5 ¾”). Carifta/World Qualifiers Six athletes met the Carifta Games standard with four of them also achieving World Jr. Championships marks at Saturday’s 5th Dag Samuels Development Series, as U18 and U20 national records also tumbled. Jaleel Croal added the 100m to his World Jr. Championships 200m qualifier, when he bolted to a personal best of 10.41 seconds, (-0.4) the No 4 All Time BVI mark, to take down Rikkoi Brathwaite’s U20 standard of 10.43. Khybah Dawson capped a scintillating combination week of track and field by snatching Keita Cline’s 31-year old U18 Long Jump mark. After a 14.32m (46’11¾”) Triple Jump to win the Elmore Stoutt High School pre-events for O’Neal House, then a 21.79 seconds 200m in the Samuel Series, he joined Croal as the BVI’s 2nd male World Jrs. qualifier, when he cut the sand at 7.58m (24’10½”), to eclipse Cline’s 7.42m (24’4¼”) from 1991. Dawson also broke Cline’s 7.50m (24’7¼”) U20 Jr. Record from 1994. Kaelyaah Liburd and Akrisa Eristee, not only qualified for the Carifta Games, but also World Jrs. Liburd’s 54.76 400m, qualified her for both events, while Eristee added the 200m, ran in 24.32, to her earlier 400m qualifier. Wanyaé Bell grabbed a 400/200m sprint double, with personal records of 48.48 and 21.49 respectively, qualifying for Carifta in both sprints. Jonathan Lynch also qualified in the U18 Boys 800m after running 2:03.26. Khamauri Crabbe dropped a 200m season’s best of 22.03 seconds in winning his heat and was 5th overall in the Spartan Invitational, after finishing 2nd in the 400m he ran in 49.30. Adajeah Hodge leapt to a season’s best 5.90m (19’4½”), to win the Chapel Hill All Comers Invite in Georgia.",
          "id": "36"
        },
        {
          "title": "KAZAKHSTAN RENDERS MEDICINES TO UKRAINE WORTH $2.2 MILLION",
          "author": "Assel Satubaldina",
          "image": "https://astanatimes.com/wp-content/uploads/2022/03/53ca9d8c8afa4c128e40a80fcaefa404.jpeg",
          "descr": "NUR-SULTAN – Kazakhstan will provide Ukraine with a batch of 25 medicines worth US$2.25 million, after the decision of the country’s Commission on International Humanitarian Aid which the Kazakh government announced on their official Telegram channel on Wednesday. The humanitarian aid weighs 82 tons. Its delivery is now being considered by the government because the delivery of cargo directly to the territory of Ukraine is currently very difficult for security reasons. “In this regard, the Government of Kazakhstan is making arrangements with neighboring states, where hubs are deployed to receive and distribute international humanitarian aid to Ukraine,” said the statement. Humanitarian activity is an important area of Kazakhstan’s foreign policy, according to the government, as it “always tries, as much as possible, to support countries whose populations, due to various circumstances, find themselves in a difficult humanitarian situation.” The provision of humanitarian aid follows on the heels of a decree by President Kassym-Jomart Tokayev. During his Monday telephone conversation with Germany’s Federal President Frank-Walter Steinmeier, President Tokayev confirmed his country’s readiness to provide humanitarian assistance to Ukraine where a humanitarian crisis has been looming over the past two weeks. Safe passage for humanitarian aid is of paramount importance now, according to the UN Emergency Relief Coordinator Martin Griffiths, as thousands of people who ended up under attack in Mariupol, Kharkiv, and elsewhere in Ukraine are in need of life-saving medical supplies. “People are watching as this unnecessary conflict engulfs cities and civilians. As well as what’s happening in Ukraine, they have an extra sense of dread over the impact this will have on the wider world. I include myself in this category,” Griffiths told the UN Security Council on Monday. While the military confrontation continues, the foreign ministers of Russia and Ukraine are holding face-to-face talks in Turkey today.",
          "id": "42"
        },
        {
          "title": "KAZAKH LANGUAGE STUDIES GAINING POPULARITY IN KAZAKHSTAN, MORE PEOPLE LEARNING ENGLISH",
          "author": "Saniya Bulatkulova",
          "image": "https://astanatimes.com/wp-content/uploads/2022/03/edustreamkz.png",
          "descr": "NUR-SULTAN – Kazakh language is recognized as the most in-demand language for learning across the country, reported the Ministry of Education and Science. According to Vice Minister of Education and Science Sholpan Karinova, 35,697 people out of 52,122 people learning languages at free courses provided by the state program for 2020-2025 and through the Ruhani Zhangyru (modernization of national identity from Kazakh) national project, have taken Kazakh courses over the past year. Another 13,159 people have taken English courses, 3,054 people have taken Russian courses, and 212 people focused on learning their native language (Armenian, Bashkir, Korean, Polish, Tatar, Turkish, German, Chinese etc). Overall, in the country’s 19 million population, 69 percent of the people are Kazakhs, 18 percent are Russians, and 3 percent are Uzbeks, the rest being Ukrainians, Uigurs, Tatars, Germans and others, according to data released by the Kazakh Bureau of National Statistics in 2021.",
          "id": "44"
        }
      ]
    }
  ]
}